Revit.Elements.FloorType
A Revit FloorType
http://revitapisearch.com.s3-website-us-east-1.amazonaws.com/html/b6fd8c08-7eea-1ab4-b7ab-096778b46e8f.htm

Revit.Elements.FloorType.#ctor(Autodesk.Revit.DB.FloorType)
Private constructor for the Element
floorType:

Revit.Elements.FloorType.InitFloorType(Autodesk.Revit.DB.FloorType)
Initialize a FloorType element
floorType:

Revit.Elements.FloorType.InternalSetFloorType(Autodesk.Revit.DB.FloorType)
Set the FloorType property, element id, and unique id
floorType:

Revit.Elements.FloorType.ByName(System.String)
Select a FloorType from the document given
name:
Returns:

Revit.Elements.FloorType.FromExisting(Autodesk.Revit.DB.FloorType,System.Boolean)
Create a FloorType from a user selected Element.
floorType:
isRevitOwned:
Returns:

Revit.Elements.FloorType.InternalFloorType
An internal reference to the FloorType

Revit.Elements.FloorType.InternalElement
Reference to the Element

Revit.Elements.FloorType.Name
The name of the FloorType